package model.data;

import java.io.InputStream;

import commons.Level;
/**
 * א. ההפרדה נעשתה ע"י הגדרת אינטרפייס נפרד ליוצר המידע ומייצג המידע (את הממשקים הללו יממשו המחלקות בהתאם)
 * ב. הפרדה זו מאפשרת לשמור על עקרון הפתיחות/סגירות מכיוון שבדרך זו אנו יוצרים אי תלות בין יוצר המידע למייצג המידע. בדרך זו אנחנו נפריד בין כל ההתנהגויות הרלוונטיות
 * לאופן בו ניצור שלב לבין כל ההתנהגויות הרלוונטיות לשלב עצמו. כל שינוי שנרצה לבצע באחד מהם יעשה בצורה הרחבה. כלומר, ניצור מחלקה חדשה שתממש 
 * את הממשק הרלוונטי.
 * ג. ההפרדה מאפשרת יותר גנריות כיוון שבאופן זה נוכל ליצור מחלקה כללית שתממש את ההתנהגויות הרלוונטיות עבור יצירת שלב, ומחלקה כללית נפרדת שתממש את ההתנהגויות הרלוונטיות 
 * לשלב עצמו. כך, נוכל ליצור עבור כל סוג של שלב וכל אופן בו נרצה לטעון שלב מחלקה שתממש את הממשקים הללו או תירש מחלקה שמימשה את הממשקים.
 * ד.
 * inputStream
 * הוא טיפוס כללי, ומכיוון שלא נרצה להגביל את ההתנהגות של טעינת שלב לסוג קובץ מסוים, כלומר לטיפוס מסוים, כדוגמת
 * String,
 * נעדיף לא להשתמש ב-
 * String
 * שהוא טיפוס ספציפי. בדרך זו נשמור על גנריות.
 */
public interface ILevelLoader{
	/**
	 * The method load a level
	 * @param is the path of the file that we need to load
	 * @return the new level that we loaded
	 */
	public Level loadLevel(InputStream is);
}


